# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# PCA για Στρατηγική Επέκτασης Αγοράς
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# ==============================================================================
# ==============================================================================
#                 ΜΕΡΟΣ Α: ΠΡΟΕΤΟΙΜΑΣΊΑ ΔΕΔΟΜΕΝΩΝ
# ==============================================================================
# ==============================================================================


# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 1. Βιβλιοθήκες (Dependencies)   
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

install.packages(c("eurostat", "tidyverse", "janitor"))

library(eurostat)
library(tidyverse)
library(janitor)

# Επιλογή μιας πρόσφατης χρονιάς

##Σχόλιο##
# Ο λόγος που το κάνουμε αυτό είναι επειδή θέλουμε να μελετήσουμε τις πόλεις
# και πώς αυτές διαφοροποιούνται όσον αφορά τους δείκτες που έχουν επιλεγεί 
# ότι χαρακτηρίζουν μια πόλη ως άξια προς επένδυση. 

# Αν δεν είχαμε σταματήσει τον χρόνο --που τώρα παίρνουμε για κάθε μεταβλητή, 
# μία χρονιά για κάθε πόλη, οπότε ο πίνακάς μας έχει στις γραμμές τις πόλεις
# και στις στήλες τις μεταβλητές-- θα είχαμε τρισδιάστατα δεδομένα (Panel Data).

year <- 2018 

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 2. Αστικοί Δείκτες Eurostat ----
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Διαθέσιμα σύνολα δεδομένων
search_results <- search_eurostat("city")
head(search_results)

# Πληθυσμός
df_pop <- get_eurostat("urb_cpop1", time_format = "num")

# Ανεργία
df_unemp <- get_eurostat("urb_clma", time_format = "num")

# Εκπαίδευση
df_educ <- get_eurostat("urb_ceduc", time_format = "num")

# Τουρισμός (ως ένδειξη δραστηριότητας / ελκυστικότητας)
df_tourism <- get_eurostat("urb_ctour", time_format = "num")

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 3. Καθαρισμός και Προετοιμασία Δεδομένων (Data Wrangling)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

df_pop <- df_pop %>% 
  filter(TIME_PERIOD == year & indic_ur == "DE1001V") %>%
  select(indic_ur, cities, values)

df_unemp <- df_unemp %>% 
  filter(TIME_PERIOD == year) %>%
  select(indic_ur, cities, values)

df_educ <- df_educ %>% 
  filter(TIME_PERIOD == year) %>%
  select(indic_ur, cities, values)

df_tourism <- df_tourism %>% 
  filter(TIME_PERIOD == year) %>%
  select(indic_ur, cities, values)

# Ενοποίηση των δεδομένων
df <- rbind(df_pop, df_unemp, df_educ, df_tourism)

# Ενημέρωση των ετικετών (ώστε να είναι πιο κατανοητές)
df <- label_eurostat(df)

# Αφαίρεση δεικτών που διαχωρίζονται σε ανδρικό και γυναικείο πληθυσμό 
df <- df %>%
  filter(!str_detect(indic_ur, regex("male|female", ignore_case = TRUE)))

# Μετατροπή σε ευρεία μορφή (ώστε κάθε πόλη να είναι μία γραμμή)
df <- pivot_wider(df,
                  names_from = indic_ur,
                  values_from = values)

# Διατήρηση μόνο των μεταβλητών με χαμηλό ποσοστό απουσιαζουσών τιμών (NAs)
df <- df[, colMeans(is.na(df)) < 0.30]

# Διατήρηση μόνο των πόλεων που δεν έχουν καθόλου απουσιάζουσες τιμές
df <- df[rowMeans(is.na(df)) == 0, ]



# ==============================================================================
# ==============================================================================
#   TASK1 ~ ΜΕΡΟΣ 2: ΠΕΡΙΓΡΑΦΙΚΗ ΣΤΑΤΙΣΤΙΚΗ & ΑΝΑΛΥΣΗ (EDA) : 
# ==============================================================================
# ==============================================================================

# ==============================================================================
# Σχόλιο: Σκοπός της EDA είναι η επιβεβαίωση της καταλληλότητας των δεδομένων για PCA:
# 1. Ελέγχουμε αν υπάρχει δομή συσχετίσεων (χωρίς αυτήν, η PCA δεν συμπυκνώνει πληροφορία).
# 2. Ελέγχουμε για αποκλίσεις στις διασπορές: αν μία μεταβλητή κυριαρχεί λόγω μονάδας
#    μέτρησης, θα παραπλανήσει την PCA αναδεικνύοντάς την λανθασμένα ως κύρια συνιστώσα.
# 3. Διαχωρίζουμε αν η μεγάλη διασπορά οφείλεται σε κλίμακα ή σε ασυμμετρία 
#    της κατανομής (που είναι μερος της πληροφορίας) . Εμένα με ενδιαφέρει να εξετάσω 

# ==============================================================================

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Έλεγχος Δεδομένων
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#ανοίγω τον πίνακα σε νέο παράθυρο σαν Excel
view(df)
# Έλεγχος της δομής και των τύπων των μεταβλητών (πρέπει να είναι numeric για την PCA)
str(df)
# Επιβεβαίωση των διαθέσιμων δεικτών της αγοράς
colnames(df)

# Προβολή των πρώτων παρατηρήσεων για τελικό οπτικό έλεγχο
head(df)

# Μετατροπή του πίνακα σε κλασικό data.frame, επειδή η προηγούμενη μορφή του (tibble)
#δεν υποστηρίζει ονομασίες γραμμών.
df <- as.data.frame(df)
# Ορίζουμε τα ονόματα των πόλεων ως ετικέτες στις γραμμές, ώστε η R να "θυμάται" 
#ποια πόλη είναι ποια όταν διαγράψουμε τη στήλη με το κείμενο.
rownames(df) <- df$cities

# Αφαιρούμε τη στήλη 'cities' για να μείνουν ΑΠΟΚΛΕΙΣΤΙΚΑ αριθμητικές μεταβλητές
df_num <- df[, -1]
city_names <- rownames(df_num)
city_names
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 1. Γενική Επισκόπηση & Αρχική Δομή
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#Mία πυκνή παρουσίαση βασικών περιγραφικών μέτρων για κάθε μεταβλητή
summary(df_num)

# Παρατηρώντας το summary(df_num), επιβεβαιώνεται ότι οι μεταβλητές βρίσκονται 
# σε διαφορετικές τάξεις μεγέθους.

#Επίσης, παρατηρώ σε αρκετές μεταβλητές όπως Total employment/jobs να υπάρχει αρκετά 
#μεγάλη απόκλιση μεταξύ διαμέσου και μέσης τιμής, πράγμα που δηλώνει δεξία ασυμμετρία

#Επίσης συχνό είναι το φαινόμενο που το ελάχιστο απο το μέγιστο διαφέρουν τάξεις 
#μεγάθους, κάτι που σημαίνει ότι υπάρχουν πόλεις που διαφέρεουν χαοτικά.

S <- cov(df_num) #πίνακας συνδιακύμανσης

# Υπολογισμός και εκτύπωση του στατιστικού phi για την τεκμηρίωση της δομής

R <- cor(df_num) #πίνακας συσχέτισης
p <- ncol(R)     #αριρθμός στηλών πίανακ <=> αριθμός  αρχικών μεταβλήτών
phi <- sqrt((sum(R^2) - p) / (p * (p - 1)))

#Το στιστικό φ επιβεβαιώνει την ύπαρξη συσχετίσεων
#θέλουμε φ>0.4: περναέι τον έλεγχο 
#μπορούμε να προχωρήσουμε σε PCA 

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  Έλεγχος Συσχετίσεων (Structure Analysis)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
library(psych)
# Ανοίγουμε ένα αρχείο PNG για να χωρέσουν όλες οι μεταβλητές
png("All_Variables_Correlations.png", width = 1600, height = 1600)

# Τυπώνουμε ΟΛΟ τον πίνακα df_num χωρίς περιορισμό
# Το cex.labels=0.8 βοηθάει να μην αλληλοκαλύπτονται τα ονόματα
pairs.panels(df_num, 
             method = "pearson", 
             hist.col = "lightblue", 
             density = TRUE, 
             ellipses = FALSE, 
             cex.labels = 0.8, 
             main = "Scatterplot and Correlation Matrix for Structure Check")

# Κλείνουμε και αποθηκεύουμε
dev.off() 

# **Ισχυρές συσχετίσεις: 
#    Yπάρχουν ισχυρές γραμμικές σχέσεις με συντελεστή συσχέτισης που αγγίζουν το 0.99 
#   (π.χ. μεταξύ δείκτη πληθυσμού και απασχόλησης). Αυτό αποτελεί αδιάψευστη απόδειξη 
#   πλεονασματικής πληροφορίας (redundant information), καθώς οι μεταβλητές αυτές παρέχουν
#   επαναλαμβανόμενη πληροφορία για την οικονομική κατάσταση των πόλεων.
#   Η PCA είναι το κατάλληλο εργαλείο για να μειωθεί αυτός ο πλεονασμός και 
#   να κρατήσουμε μόνο την ουσιαστική πληροφορία των δεδομένων.


# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  Έλεγχος Διασποράς & Κλίμακας
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Υπολογισμός διακυμάνσεων
variances <- apply(df_num, 2, var)

# Ταξινόμηση από τη μεγαλύτερη στη μικρότερη για να φανεί η χαοτική διαφορά
sorted_vars <- sort(variances, decreasing = TRUE)

print(sorted_vars)

png("Variance.png", width = 1200, height = 800)
par(mar = c(15, 5, 4, 2)) # Δίνουμε 15 ίντσες χώρο κάτω!
barplot(log10(sorted_vars), 
        las = 2,          # Κάθετα ονόματα
        main = "Log10 Variances", 
        ylab = "log10(Variance)", 
        col = "steelblue",
        cex.names = 0.7)  # Λίγο πιο μικρά για να χωράνε
dev.off()


# **Μεγάλη Διακύμανση: 
#    Παρατηρώ χαοτική διαφορά στις τάξεις μεγέθους.Μεταβλητές όπως το "Population" και το "Total employment" 
#    παρουσιάζουν τη μέγιστη μεταβλητότητα, ενώ  δείκτες όπως "Activity rate" ή"Unemployment rate"
#    εμφανίζουν χαμηλότερη μεταβλητότητα, γεγονός που υποδηλώνει ότι οι πόλεις διαφέρουν 
#    κυρίως ως προς το απόλυτο μέγεθός τους και λιγότερο ως προς τις δομικές τους αναλογίες.





# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Γραφήματα Outliers 
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# **Πρίν τα γραφήματα αντικαθιστώ τα ονόματα των μεταβλητών με συντομογραφίες 
#  για να είναι πιο ευανάγνωστα τα γραφήματα

#  Φτιάχνουμε τα νέα σύντομα ονόματα
short_names <- paste0("V", 1:ncol(df_num))

rename_df <- data.frame(ShortName = short_names, OriginalName = colnames(df_num))
print("--- ΛΕΞΙΚΟ ΜΕΤΑΒΛΗΤΩΝ ΓΙΑ ΤΟ REPORT ---")
print(rename_df)

# Για να τρέξουν τα γραφήματα, μετονομάζουμε προσωρινά το df_num
df_plot <- df_num
colnames(df_plot) <- short_names


# Α. Τυποποιημένα Boxplots (Φαίνονται ξεκάθαρα τα outliers ανά μεταβλητή) - Αποθήκευση σε PNG
png("Scaled_Boxplots.png", width = 1200, height = 600)
par(mar = c(4, 4, 3, 1)) # Κανονικά περιθώρια πλέον!
boxplot(scale(df_plot), col = "lightblue", pch = 19,
        main = "Standardized Boxplots (Outlier Detection)",
        xlab = "Variables (V1-V28)", ylab = "Standardized Values (Z-scores)")
dev.off()
#ΣΧόλιο: 
# Κάθε μεταβλητή έχει ακραίες τιμές (Outliers) με τιμές Z-scores>10
#Κάτι που σημαίνει ότι τα outliers είναι στατιστικά σημαντικά και είναι μέρος της 
#πληροφορίας. Οι πόλεις με μεγάλο πλυθυσμό τραβάνε μέσο όρο-διασπορά προς τα πάνω.



# Β. Parallel Coordinates (Spaghetti Plot - Εντοπισμός ακραίων πόλεων)
library(MASS)
png("Parallel_Coordinates.png", width = 1400, height = 700)
par(mar = c(4, 4, 3, 1))
parcoord(scale(df_plot), col = rainbow(nrow(df_plot)), var.label = TRUE, 
         main = "Parallel Coordinates (Scaled Data)")
dev.off()

#Επιβεβαιώνεται κάπως η εικόνα που έχει φανέι απο πρίν, ότι δηλαδή υπάρχουν οι 
#"μεγάλες" πόλεις που τραβιούνται πολύ πάνω απο τις πολλές που κινούνται μαζί 



# ==============================================================================
# ==============================================================================
# ~ ΜΕΡΟΣ 3: ΕΦΑΡΜΟΓΉ ΤΗΣ PCA
# ==============================================================================
# ==============================================================================


# Εφαρμόζω PCA σε τυποποιημένα δεδομένα. 
# Γνωρίζω θεωρητικά ότι ο πίνακας συσχέτισης των αρχικών μεταβλητών ισούται 
# με τον πίνακα συνδιακύμανσης των τυποποιημένων μεταβλητών. 
# Επομένως,υπολογίζω τις ιδιοτιμές και τα ιδιοδιανύσματα 
# απευθείας πάνω στον πίνακα συσχέτισης (R).
# Υπολογίζουμε τον πίνακα συσχέτισης (ισοδύναμο με PCA σε scaled δεδομένα)

R <- cor(df_num)
eigR <- eigen(R)
eigR$vectors <- t(eigR$vectors)
# Υπολογισμός ποσοστού διακύμανσης (Variance Explained)
perc_var <- (eigR$values / sum(eigR$values)) * 100
cum_var <- cumsum(perc_var)

#Πινακάκι: Ιδιοτιμες-Ποσοστό πληροφορίας που εξηγει-Αθροιστικο ποσοστό
eigTable <- data.frame(
  Component = 1:ncol(df_num),
  Eigenvalue = eigR$values,
  Variance_Perc = perc_var,
  Cumulative_Perc = cum_var
)

print("--- Πίνακας Ιδιοτιμών & Επεξηγούμενης Διασποράς ---")
print(round(eigTable, 2))

#Τα ιδιοδιανύσματα του πίνακα συσχετίσεων
round((eigR$vectors),6)




#Παρατηρήσεις: 
#  1)Η πρώτη κύρια συνιστώσα εξηγεί μόνη της το 71% της συνολικής διασποράς και 
#  σε συνδιασμό με το ότι τα laodings της με εξαιρεσεις κάτι αμελητέα αρνητικά
#  είναι θετικά, μπορούμε να την δούμε ως  σταθμισμένο μέσο των μεταβλητών και 
#  ως ένα γενικό δείκτη

#  2)Η πρώτη συνιστώσα στην ουσία αποτυπώνει το γεγονός ότι "μεγάλες" πόλεις 
#  θα έχουν υψηλούς δείκτες σε όλες τις παραμέτρους και το ανάποδο. 

#  3) Οι επόμενες συνιστώσες φωτίζουν αντιθέσεις (contrasts) στη δυναμική μιας  
#  οικονομίας και όψεις του πώς είναι δομημένη. Παραδείγματος χάρη, η δεύτερη  
#  συνιστώσα αποτυπώνει τη σχέση μεταξύ τουριστικής δταστηριότητςα  και εκπαιδευτικής
#  κατάρτισης. Συγκεκριμένα, τα ετερόσημα βάρη της διαχωρίζουν τις πόλεις που εξαρτώνται  
#  από τον τουρισμό (αρνητικά loadings σε κλίνες, διανυκτερεύσεις και ανεργία)  
#  από εκείνες που διαθέτουν σταθερό, τεχνικά καταρτισμένο εργατικό δυναμικό  
#  (θετικό loading στο επίπεδο εκπαίδευσης ISCED 3-4). Ο δείκτης της ανεργίας 
#  συνηγορεί σε ατυτη την πραγματικότητα, πηγαίνοντας μαζί με μια ενίσχυση στον 
#  τουριστικό τομέα έναντι της εκπαίδευσης. Αντίστοιχα, η τρίτη συνιστώσα αποτυπώνει
#  την ανώτερη εκπαίδευση, με θετικά βάρη να λαμβάνουν οι μεταβλητές που μετράνε
#  ανώτερη εκπαίδευση και αρνητικά την μεσαία

#  Συνοψίζοντας: 
#      1η ΚΣ: Δείκτης Αστικού Μεγέθους
#      2η ΚΣ: Φύση τοπικής Οικονομίας (Τουρισική Δραστηριότητα/Παραγωγικό Δυναμικό)
#      3η ΚΣ: Δείκτης Ακαδημαικης Εκπαίδευσης


#  Επιλογή αριθμού κυρίων συνιστωσών & Σύγκριση Κριτηρίων

# 1. Κριτήριο Kaiser (Ιδιοτιμές > 1: αντιπροσωπεύουν μεταβλητότητα μεγαλύτερη 
# από μια τυποποιημένη αρχική μεταβλητή) .Συνήθως υπερεκτιμούν 

kaiser_components <- sum(eigR$values > 1)
print(paste("Βάσει του κριτηρίου Kaiser, προτείνονται:", kaiser_components, "συνιστώσες."))

# 2. Κριτήριο Συνολικής Διασποράς (π.χ. > 75% ή 80%)
target_variance <- 85 # Μπορείς να παίξεις με αυτό το νούμερο
var_components <- which(eigTable$Cumulative_Perc >= target_variance)[1]
print(paste("Για να εξηγήσουμε >", target_variance, "% της διασποράς, χρειαζόμαστε:", var_components, "συνιστώσες."))


# 3, Δημιουργία Scree Plot (Αποθήκευση σε PNG)
png("Scree_Plot.png", width = 800, height = 600)
plot(eigTable$Component, eigTable$Eigenvalue, type = "b", pch = 19, col = "steelblue",
     xlab = "Component Number", ylab = "Eigenvalue", 
     main = "Scree Plot (Standardized Data)")
dev.off()
#  Συνδιάζοντας τα κριτήρια, καταλήγω στις 3 συνιστώσες εξηγούν μια 
k <- 3



# Υπολογισμός Scores για τις πρώτες  δύο συνιστώσες

# Υπολογίζουμε τα scores πολλαπλασιάζοντας τα ΤΥΠΟΠΟΙΗΜΕΝΑ δεδομένα 
# με τα loadings των k συνιστωσών που κρατήσαμε
scores1 <- scale(df_num) %*% eigR$vectors[1,] #οι προβολές των μεταβλητών στο 
                                              #1ο ιδιοδιάνυσμα/αξονα/κυθρια συνιστώσα

names(scores1) <- rownames(df_num)
scores1_sorted<-order(scores1)

cat("--- ΧΕΙΡΟΤΕΡΑ (5 πρώτα) ---\n")
print(scores1[scores1_sorted[1:5]])

cat("\n--- ΚΑΛΥΤΕΡΑ (5 τελευταία) ---\n")
print(scores1[scores1_sorted[(length(scores1)-4):length(scores1)]])

scores2 <- scale(df_num) %*% eigR$vectors[2,]
names(scores2) <- rownames(df_num)
scores2_sorted<-order(scores2)

cat("--- ΧΕΙΡΟΤΕΡΑ (5 πρώτα) ---\n")
print(scores2[scores2_sorted[1:5]])

cat("\n--- ΚΑΛΥΤΕΡΑ (5 τελευταία) ---\n")
print(scores2[scores2_sorted[(length(scores2)-4):length(scores2)]])

#Παρατηρήσεις: 

#Για την 1η Κύρια Συνιστώσα:

#  Τα 5 μικρότερα(π.χ. Hayange, Görlitz):
#  Πρόκειται για μικρές, περιφερειακές πόλεις. Το αρνητικό τους σκορ 
#  επιβεβαιώνει ότι η PC1 αποτυπώνει την αστική κλίμακα, τοποθετώντας 
#  τις πόλεις με μικρό πληθυσμιακό και οικονομικό αποτύπωμα στο κάτω άκρο.

#  Τα 5 μεγαλύτερα/θετικά σκορ (π.χ. Paris, Berlin, Madrid):
#  Όπως αναμενόταν, στην κορυφή κυριαρχούν οι μητροπόλεις

#Για την 2η Κύρια Συνιστώσα:

#  Τα 5 μικρότερα(π.χ. Benidorm, Torremolinos):
#  Οι πόλεις με τα πιο αρνητικά σκορ είναι όλες τουριστικά θέρετρα.
#  Αυτό αποδεικνύει ότι το αρνητικό άκρο της PC2 
#  ταυτίζεται απόλυτα με τουριστικές οικονομίες (και την αντίστοιχη εποχικότητα/ανεργία).

#  Τα 5 μεγαλύτερα/θετικά σκορ:
#  Στον αντίποδα, οι πόλεις με υψηλά θετικά σκορ στην PC2 διαφοροποιούνται 
#  από το τουριστικό μοντέλο, αναδεικνύοντας ένα προφίλ που βασίζεται 
#  περισσότερο στην τεχνική εξειδίκευση και τον παραγωγικό τομέα.


# Υπολογισμός και της 3ης συνιστώσας (για να είναι πλήρης η ανάλυση)
scores3 <- scale(df_num) %*% eigR$vectors[3,]
names(scores3) <- rownames(df_num)
# LOADING PLOT (Μεταβλητές) - Αποθήκευση σε PNG
png("Loading_Plot.png", width = 800, height = 800)
# Στον άξονα Χ η PC1, στον άξονα Υ η PC2. 
# Κάθε κουκκίδα είναι μία μεταβλητή (από το 1 έως το 27).
plot(eigR$vectors[1, ], eigR$vectors[2, ], 
     xlab = "PC1 (Loadings)", ylab = "PC2 (Loadings)",
     main = "Task 4: Variable Loadings Plot",
     pch = 19, col = "blue")
abline(h = 0, v = 0, lty = 2)
text(eigR$vectors[1, ], eigR$vectors[2, ], labels = 1:ncol(df_num), pos = 3, cex = 0.7)
dev.off()

#Να μπορέσουμε να αναγνωρίσουμε ποιές μεταβλητές εμφανίζονται στο γράφημα
loadings_matrix <- data.frame(
  Variable = colnames(df_num),
  PC1 = eigR$vectors[1,],
  PC2 = eigR$vectors[2,]
)

# Δες τον πίνακα για να ταυτοποιήσεις τις τελείες
View(loadings_matrix)

#Σχόλια: 
#     1)Παρατηρώ ότι στο δεξί μερος του γραφηματος (μεγαλα loadings στον αξονα  Χ)
#     συγκεντρώνονται στο δεξί άκρο του άξονα PC1 κατι που υποδηλωνει 1) ισχυρή 
#     συσχέτιση και κοινή συμπεριφορά.Τέτοιες μεταβλητές είναι, λόγου χάρη,
#     ο συνολικός πληθυσμός της πόλης, ο συνολικός αριθμός των απασχολούμενων 
#     και η απασχόληση στον τομέα των κατασκευών Στην ουσία αυτές οι μεταβλητές 
#     συνεισφέρουν ισότιμα στην PC1 και αποτελουν τους εκπροσώπους του αξονα που 
#     ορίζει το  Αστικο Μέγεθος των πόλεων

#     2)Ενώ αρχικά η 2η Κύρια Συνιστώσα (PC2) ερμηνεύτηκε ευρύτερα ως 'Φύση της
#     Τοπικής Οικονομίας', η λεπτομερής εξέταση των loadings στο Loading Plot
#     επιτρέπει μια πιο ακριβή εξειδίκευση: Η συνιστώσα αυτή διαχωρίζει τις πόλεις
#     όχι μόνο βάσει τουρισμού, αλλά βάσει του Ανθρώπινου Κεφαλαίου. Στο θετικό 
#     της άκρο, μεταβλητές όπως η Εκπαίδευση (19) και η Δραστηριότητα (2, 21) 
#     υποδεικνύουν μοντέλα οικονομίας βασισμένα στη γνώση, διαφοροποιώντας τα από 
#     το μοντέλο τουριστικής εξάρτησης που αποτυπώνεται στο αρνητικό άκρο.

#     3) Τέλος, απουσιάζουν μεταβλητές από το απόλυτο κέντρο (0,0) του γραφήματος.
#     Αυτό αποδεικνύει ότι η ομαδοποίηση είναι εξαιρετικά καθαρή και ισχυρή,
#     καθώς δεν υπάρχουν δείκτες που να παρέχουν εντελώς ασαφή (ambiguous) ή 
#     μηδενική πληροφορία. Σχεδόν όλες οι μεταβλητές συμμετέχουν ενεργά στη 
#     διαμόρφωση είτε του πρώτου, είτε του δεύτερου άξονα.

#  SCORES PLOT (Γράφημα Πόλεων) 
# Συνδυασμός scores 1 και 2 σε ένα matrix για ευκολία
scores <- cbind(scores1, scores2)

#  Φτιάχνουμε το γράφημα - Αποθήκευση σε PNG
png("Cities_Scores_Plot.png", width = 1000, height = 1000)
plot(scores[, 1], scores[, 2], 
     main = "Task 5: Cities Scores Plot",
     xlab = "PC1 (Αστικό Μέγεθος)", 
     ylab = "PC2 (Προφίλ Πόλης: Τουρισμός vs Εκπαίδευση)", 
     pch = 19, col = "darkgreen")

# Βάζουμε τους άξονες στο 0
abline(h = 0, v = 0, lty = 2)
# Προσθέτουμε τα ονόματα των πόλεων (επιλεκτικά για να μην γεμίσει το γράφημα)
text(scores[, 1], scores[, 2], labels = rownames(df_num), pos = 3, cex = 0.5)
dev.off()

#Φτιάχνουμε το dataframe με τα scores των πόλεων
scores_matrix <- data.frame(
  City = rownames(df_num),
  PC1_Score = as.numeric(scores1),
  PC2_Score = as.numeric(scores2)
)



# Ανοίγουμε τον πίνακα για να δούμε καθαρά κάθε πόλη
View(scores_matrix)


#   1)Παρατηρώ ότι υπάρχουν πολλές πόλεις που βρίσκονται στο κέντρο , υποδηλώνοντας 
#   ότι οι περισσότερες πόλεις έχουν το αναμενόμενο σκόρ στους δείκτες του αστικού 
#   μεγέθους και οικονομικής δομής , υπάρχουν βέβαια ακραίες τιμές που απο την μια 
#   ως προς την PC1 είναι οι μητροπόλεις

#   2)Από την άλλη , η ανάλυση της PC2 αποκαλύπτει ένα ενδιαφέρον σχήμα: 
#   Οι πόλεις της Κεντρικής και Βόρειας Ευρώπης (π.χ. Γερμανία, Βαλτική) 
#   καταλαμβάνουν σταθερά το θετικό άκρο του άξονα, εκπροσωπώντας ένα μοντέλο 
#   σταθερής βιομηχανικής δραστηριότητας και ανθρώπινου κεφαλαίου. 
#   Στον αντίποδα, το αρνητικό άκρο της PC2 κυριαρχείται από πόλεις της 
#   Ισπανίας και της Νότιας Γαλλίας. Οι ακραίες αρνητικές τιμές (outliers) 
#   εντοπίζονται σχεδόν αποκλειστικά σε μεγάλα μεσογειακά θέρετρα 
#   (όπως το Benidorm, το Torremolinos και το Fréjus), επιβεβαιώνοντας ότι η 
#   συνιστώσα αυτή αποτυπώνει το μοντέλο της τουριστικής μονοκαλλιέργειας και της 
#   συναφούς εργασιακής αστάθειας του ευρωπαϊκού Νότου 
 

#PCA σε μη τυποποιημένα δεδομένα


#  Εξαγωγή Ιδιοτιμών και Ιδιοδιανυσμάτων
eigS <- eigen(S)

#  Πίνακας Ιδιοτιμών & Διασποράς
perc_var_S <- (eigS$values / sum(eigS$values)) * 100
cum_var_S <- cumsum(perc_var_S)

eigTable_S <- data.frame(
  Component = 1:ncol(df_num),
  Eigenvalue = eigS$values,
  Variance_Perc = perc_var_S,
  Cumulative_Perc = cum_var_S
)

# Τύπωμα των αποτελεσμάτων
print("--- Πίνακας Ιδιοτιμών & Επεξηγούμενης Διασποράς (S) ---")
print(round(eigTable_S, 2))

print("--- Ιδιοδιανύσματα (S) ---")
head(round(eigS$vectors, 6))

#  Οι μεταβλητές που παρουσίαζαν μεγάλες διαφορές στην κλίμακα και στην διασπορά 
#  αναμέναμε να επηρεάσουν την PCA και να μεροληπτήσει υπέρ τους βγάζοντας αποτελεσματα
#  που δεν χαρακτηρίζονται απο ιδιαίτερη ισορροπία. Παρατηρούμε ότι η πρώτη ιδιοτιμή 
#  εξηγεί σχεδόν όλο το ποσοστό της της διασποράς και το ιδιοδιάνυσμα που αντιστοιχεί 
# σε αυτή σχεδόν ταυτίζεται με την μεταβλητή Acticity rate μόνο και μόνο επειδή 
#  έχει μεγάλα νούμερα.

